In [11]:
import numpy as np
import pandas as pd

In [12]:
df=pd.read_csv("income.csv")
df

       name      income
0    Manish      500000
1  Benjamin        2000
2    Rakesh        3000
3     Harry       40000
4  Franklin       23000
5     Vijay       32000
6      Elon  1000000000

In [13]:
df.describe()

             income
count  7.000000e+00
mean   1.429429e+08
std    3.779267e+08
min    2.000000e+03
25%    1.300000e+04
50%    3.200000e+04
75%    2.700000e+05
max    1.000000e+09

In [14]:
df.income.quantile(0.25)

13000.0

In [15]:
percentile_99=df.income.quantile(0.99)
percentile_99

940029999.9999995

In [16]:
df_no_outlier=df[df.income<=percentile_99]
df_no_outlier

       name  income
0    Manish  500000
1  Benjamin    2000
2    Rakesh    3000
3     Harry   40000
4  Franklin   23000
5     Vijay   32000

In [17]:
df.loc[3,"income"]=np.NaN
df

       name        income
0    Manish  5.000000e+05
1  Benjamin  2.000000e+03
2    Rakesh  3.000000e+03
3     Harry           NaN
4  Franklin  2.300000e+04
5     Vijay  3.200000e+04
6      Elon  1.000000e+09

In [18]:
df_new=df.fillna(df.income.median())
df_new

       name        income
0    Manish  5.000000e+05
1  Benjamin  2.000000e+03
2    Rakesh  3.000000e+03
3     Harry  2.750000e+04
4  Franklin  2.300000e+04
5     Vijay  3.200000e+04
6      Elon  1.000000e+09